update test + fix bugs + update docs
